In [1]:
import numpy as np
import pandas as pd

In [2]:
labels=['i','ii','iii']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [3]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(data=my_data,index=labels)

i      10
ii     20
iii    30
dtype: int64

In [5]:
pd.Series(my_data,labels)

i      10
ii     20
iii    30
dtype: int64

In [6]:
pd.Series(arr,labels)

i      10
ii     20
iii    30
dtype: int32

In [7]:
d

{'a': 10, 'b': 20, 'c': 30}

In [8]:
ser1= pd.Series([1,2,3,4],['USA','Nepal','UAe','India'])
ser1

USA      1
Nepal    2
UAe      3
India    4
dtype: int64

In [9]:
ser2=pd.Series([1,2,5,4],['Italy','Nepal','UAE','Canada'])
ser2

Italy     1
Nepal     2
UAE       5
Canada    4
dtype: int64

In [10]:
ser1['USA']

1

In [11]:
ser3=pd.Series(data=labels)
ser3

0      i
1     ii
2    iii
dtype: object

In [12]:
ser1+ser2

Canada    NaN
India     NaN
Italy     NaN
Nepal     4.0
UAE       NaN
UAe       NaN
USA       NaN
dtype: float64

In [13]:
from numpy.random import randint
np.random.seed(101)

In [14]:
#DataFrame is a bunch of series 
df =pd.DataFrame(randint(5,10,(5,4)),['A','B','C','D','E'],['w','x','y','z']) 
df

   w  x  y  z
A  8  6  8  6
B  5  9  5  9
C  9  5  9  5
D  6  8  7  5
E  8  8  8  7

In [15]:
df['w'] #grab data from dataframe

A    8
B    5
C    9
D    6
E    8
Name: w, dtype: int32

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
df[['w','y']]

   w  y
A  8  8
B  5  5
C  9  9
D  6  7
E  8  8

In [18]:
#defining new column new by adding 2 to col w
df['new']=df['w']+2
df

   w  x  y  z  new
A  8  6  8  6   10
B  5  9  5  9    7
C  9  5  9  5   11
D  6  8  7  5    8
E  8  8  8  7   10

In [19]:
#deleting a column, and axis 1 refers to col while axis 0 means row
df.drop('new', axis=1, inplace=True)

In [20]:
df #with inplace=True new col is permanently deleted

   w  x  y  z
A  8  6  8  6
B  5  9  5  9
C  9  5  9  5
D  6  8  7  5
E  8  8  8  7

In [21]:
df.drop('E',axis=0)

   w  x  y  z
A  8  6  8  6
B  5  9  5  9
C  9  5  9  5
D  6  8  7  5

In [22]:
df.shape

(5, 4)

In [23]:
#selectiong rows
df.loc['A']

w    8
x    6
y    8
z    6
Name: A, dtype: int32

In [24]:
df.iloc[0]

w    8
x    6
y    8
z    6
Name: A, dtype: int32

In [25]:
df

   w  x  y  z
A  8  6  8  6
B  5  9  5  9
C  9  5  9  5
D  6  8  7  5
E  8  8  8  7

In [26]:
df.loc['D','x']

8

In [27]:
df.loc[['B','D'],['w','y']]

   w  y
B  5  5
D  6  7

In [28]:
a=pd.DataFrame(randint(1,50,(4,4)),['p','q','r','s'],['w','x','y','z'])
np.random.seed(123)
a

    w   x   y   z
p  45   9  20  11
q  13  32  44  24
r   1  42  10  48
s   9  37  20  36

In [29]:
a=pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,2,3,5],[7,1,1,2]],['p','q','r','s'],['w','x','y','z'])
a

   w  x  y  z
p  1  2  3  4
q  5  6  7  8
r  9  2  3  5
s  7  1  1  2